# импортируем модуль emoji для отображения эмоджи
from emoji import emojize

# ответ пользователю при нажатии /start
start_message = """
Здравствуйте, {}.
Готов помочь Вам с раздельным сбором отходов.
Выберите интересующую Вас категорию.
"""

# ответ пользователю при нажатии /help
help_message = """
Уважаемый {}, перед Вами клавиатура.
После нажатия на любой вид отхода, Вам будет представлено меню действий.
При нажатии на кнопки "Что принимается" или "Что не принимается" в некоторых категориях Вам будут представлены кнопки с предметами, а в некоторых - будет прислано одно изображение с описанием.
При нажатии на кнопки с предметами Вы будете перенаправлены на пост вспомогательного канала с изображением и подробным описанием.
Кнопки "Как подготовить к сдаче" и "Зачем сдавать" во всех категориях выведут соответствующую информацию.
Кнопка "Куда сдавать" предназначена только для мобильного приложения.
Бот запросит Вашу геолокацию и вернёт координаты ближайшей точки РСО.
Если вдруг пропадёт клавиатура, то Вы можете прописать /help или /start.
"""

# ответ пользователю при нажатии кнопки "Назад"
info_when_back = """
Вы вернулись назад в Главное меню.
Выберите интересующую Вас категорию.
"""

# ответ пользователю при посещении блока "О продукте"
info_about = """
Данный бот разработан с целью поднятия культуры раздельного сбора отходов (РСО) населения.
С помощью кнопок навигации пользователь может найти всю необходимую информацию по основным категориям отходов и получить маршрут до ближайшего пункта сбора отходов.
"""

# ответ пользователю при нажатии на кнопку какой-либо категории мусора
start_category = """
Пожалуйста, выберите что Вы хотите узнать: 
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Стекло"
accepted_glass = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема стеклотары <b>принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Что не принимается" в разделе "Стекло"
rejected_glass = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема стеклотары <b>не принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Стекло"
preparation_glass = """
1.  Стеклотару необходимо ополоснуть и высушить
2.  С банок рекомендуется снять крышки
3.  Этикетки, дозаторы и прочее удалять не надо
4.  Битое стекло желательно сложить в какую-либо емкость
"""

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Стекло"
meaning_glass = """
1.  Снижение общего уровня загрязнения
2.  Снижение себестоимости стеклянных изделий
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Бумага"
accepted_paper = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема макулатуры <b>принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Что не принимается" в разделе "Бумага"
rejected_paper = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема макулатуры <b>не принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Бумага"
preparation_paper = """
1.  Удалить лишние материалы: металичесские пружины, скобы, скрепки, скотч. Из конвертов вырезать пластиковые окошки.
2.  Если макулатура влажная, предварительно её просушить
3.  Если на картоне есть жирные пятна, их нужно вырезать
4.  Коробки разобрать и компактно сложить
5.  Рассортировать макулатуру на гофрокартон и все остальное
6.  Упаковать макулатуру в картонные коробки или перевязать крепкими веревками
"""

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Бумага"
meaning_paper = """
1.  Сокращение вырубки леса
2.  Уменьшение объемов свалок
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Пластик"
accepted_plastic = """
Прежде всего необходимо определить к какому виду пластика относится Ваш предмет.
При нажатии на интересующий вид пластика Вы будете перенаправлены на пост с изображением, которое надо найти на предмете.
В пунктах приема пластика <b>принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Что не принимается" в разделе "Пластик"
rejected_plastic = """
Прежде всего необходимо определить к какому виду пластика относится Ваш предмет.
При нажатии на интересующий вид пластика Вы будете перенаправлены на пост с изображением, которое надо найти на предмете.
В пунктах приема пластика <b>не принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Пластик"
preparation_plastic = """
1.  Ополоснуть от остатков пищи, жира, бытовой химии.
2.  Рассортировать пластик по видам.
3.  Стоит сделать упаковку компактнее.
4.  Необходимо снять крышки, дозаторы и этикетки с бутылок.
5.  Рассортировать продукцию на бесцветную и всю остальную.
"""

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Пластик"
meaning_plastic = """
1.  Среднее время разложения пластмассовых изделий - от 6 месяцев до 700 лет.
2.  От выкинутого пластика гибнет природа и ее обитатели. 
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Металл"
accepted_metal = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема металла <b>принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Что не принимается" в разделе "Металл"
rejected_metal = """
Нажмите на интересующую позицию ниже для просмотра изображений.
В пунктах приема металла <b>не принимаются</b>:
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Металл"
preparation_metal = """
1.  Ополоснуть от остатков пищи и высушить
2.  Снять крышки и этикетки
3.  По возможности сжать
4.  Мелкие предметы сложить в металлическую коробку, чтобы не рассыпались
"""

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Металл"
meaning_metal = """
1.  Переработка металлолома экономит до 75% энергии
2.  А также снижает вредные выбросы на 86%
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Тетрапак"
accepted_tetrapak = """
Тетрапак состоит из нескольких слоев картона, полиэтилена и фольги.
Определить тетрапак помогает маркировка на упаковках: 81, 82 или 84.
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Тетрапак"
preparation_tetrapak = """
1.  Отогнуть все уголки и разрезать упаковку
2.  Хорошо сполоснуть от остатков содержимого и просушить
3.  Компактно сложить
4.  Сдавать можно с трубочками, крышками и горлышком
"""

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Тетрапак"
meaning_tetrapak = """
1.  Чтобы ценные материалы продолжали приносить пользу, а не гнили на свалках.
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Батарейки"
accepted_battery = """
Нажмите на интересующую позицию для просмотра изображений.
В пунктах приема батареек <b>принимают</b> следующие виды аккумуляторов:
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Батарейки"
preparation_battery = """
1.  Упаковать в непромокаемый пакет, пластиковую тару с крышкой или специальный контейнер для хранения батареек. 
2.  {} <b>Батарейки и аккумуляторы нельзя хранить в металлической таре</b>
""".format(emojize(':warning:'))

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Батарейки"
meaning_battery = """
1.  Батарейки и аккумуляторы состоят из токсичных веществ. 
2.  Когда их корпус разрушается, все вещества попадают в почву и воду, отравляя их.
"""

# ответ пользователю при нажатии на кнопку "Что принимается" в разделе "Лампочки"
accepted_bulb = """
Из всех ламп только ртутные или люминесцентные относятся к первому классу опасности и требует специальной утилизации. 
название модели таких лампочек будет начинаться с буквенного обозначения «Л», то есть «люминесцентная».
Лампы накаливания, галогенные и светодиодные считаются безопасными, но их также могуть принять.
Изображение создано <a href="https://www.freepik.com">Freepik</a>.
"""

# ответ пользователю при нажатии на кнопку "Как подготовить" в разделе "Лампочки"
preparation_bulb = """
1.  Сделать так, чтобы лампочки не разбились
2.  <b>Если всё-таки разбили:</b>
2.1.  Вывести всех из комнаты и открыть окно. {}<b>Важно, чтобы не было сквозняка – он раздует пары ртути.</b>
2.2.  Аккуратно, лучше в перчатках, собрать крупные осколки в стеклянную банку или в герметичный пакет.
2.3.  Мелкие частички собрать скотчем или пластилином.
2.4.  Плотно закрыть ёмкость, в которую собирали осколки.
2.5.  Помыть пол сильным чистящим средством. {}<b>Ни в коем случае не пылесосить – эффект как от сквозняка.</b>
3.  Отвезти собранные лампочки или осколки в ближайший пункт приёма 
""".format(emojize(':warning:'), emojize(':warning:'))

# ответ пользователю при нажатии на кнопку "Зачем сдавать" в разделе "Лампочки"
meaning_bulb = """
1.  Если лампочка попадёт на обычную свалку, то ртуть из лампочек рано или поздно проникнет в почву, воду, атмосферу. 
2.  Это принесёт непоправимый вред для экологии и для здоровья человека.
"""

# ответ пользователю при отправке любого текста
other_commands = """
К сожалению, я не могу Вам ответить на этот запрос.
Я настроен работать только с представленными кнопками.
"""

# словарь ответов пользователю
MESSAGES = {
    'start_message': start_message,
    'help_message': help_message,
    'info_when_back': info_when_back,
    'info_about': info_about,
    'start_category': start_category,
    'accepted_glass': accepted_glass,
    'rejected_glass': rejected_glass,
    'preparation_glass': preparation_glass,
    'meaning_glass': meaning_glass,
    'accepted_paper': accepted_paper,
    'rejected_paper': rejected_paper,
    'preparation_paper': preparation_paper,
    'meaning_paper': meaning_paper,
    'accepted_plastic': accepted_plastic,
    'rejected_plastic': rejected_plastic,
    'preparation_plastic': preparation_plastic,
    'meaning_plastic': meaning_plastic,
    'accepted_metal': accepted_metal,
    'rejected_metal': rejected_metal,
    'preparation_metal': preparation_metal,
    'meaning_metal': meaning_metal,
    'accepted_tetrapak': accepted_tetrapak,
    'preparation_tetrapak': preparation_tetrapak,
    'meaning_tetrapak': meaning_tetrapak,
    'accepted_battery': accepted_battery,
    'preparation_battery': preparation_battery,
    'meaning_battery': meaning_battery,
    'accepted_bulb': accepted_bulb,
    'preparation_bulb': preparation_bulb,
    'meaning_bulb': meaning_bulb,
    'other_commands': other_commands
}

# словарь кнопок для отходов, которые принимаются в категории "Стекло"
GLASS_ACCEPTED_LIST = {
    1: 'Небитые бутылки',
    2: 'Небитые банки или пузырьки',
    3: 'Стеклобой',
    4: 'Листовое стекло',
    5: 'Медицинские бутыли',
}

# словарь url для поиска изображений в пункте "Что принимается" в категории "Стекло"
GLASS_ACCEPTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/4',
    2: 'https://t.me/rso_help_dir/5',
    3: 'https://t.me/rso_help_dir/16',
    4: 'https://t.me/rso_help_dir/17',
    5: 'https://t.me/rso_help_dir/18'
}

# словарь кнопок для отходов, которые не принимаются в категории "Стекло"
GLASS_REJECTED_LIST = {
    1: 'Автомобильные стекла',
    2: 'Зеркала',
    3: 'Оптические стекла',
    4: 'Лампочки',
    5: 'Стеклянная и керамическая посуда',
}

# словарь url для поиска изображений в пункте "Что не принимается" в категории "Стекло"
GLASS_REJECTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/19',
    2: 'https://t.me/rso_help_dir/24',
    3: 'https://t.me/rso_help_dir/25',
    4: 'https://t.me/rso_help_dir/26',
    5: 'https://t.me/rso_help_dir/27'
}

# словарь кнопок для отходов, которые принимаются в категории "Бумага"
PAPER_ACCEPTED_LIST = {
    1: 'Гофрокартон',
    2: 'Картон',
    3: 'Использованная офисная бумага',
    4: 'Полиграфия',
    5: 'Измельчённая бумага',
}

# словарь url для поиска изображений в пункте "Что принимается" в категории "Бумага"
PAPER_ACCEPTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/28',
    2: 'https://t.me/rso_help_dir/29',
    3: 'https://t.me/rso_help_dir/30',
    4: 'https://t.me/rso_help_dir/31',
    5: 'https://t.me/rso_help_dir/32'
}

# словарь кнопок для отходов, которые не принимаются в категории "Бумага"
PAPER_REJECTED_LIST = {
    1: 'Тетрапак',
    2: 'Ламинированная бумага',
    3: 'Одноразовая посуда',
    4: 'Обои',
    5: 'Калька',
    6: 'Пергаментная бумага',
    7: 'Термобумага',
    8: 'Бумажно-гигиеническая продукция',
    9: 'Бумага со следами жира или масла',
    10: 'Упаковка от яиц',
    11: 'Пачка от сигарет',
}

# словарь url для поиска изображений в пункте "Что не принимается" в категории "Бумага"
PAPER_REJECTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/33',
    2: 'https://t.me/rso_help_dir/34',
    3: 'https://t.me/rso_help_dir/35',
    4: 'https://t.me/rso_help_dir/36',
    5: 'https://t.me/rso_help_dir/37',
    6: 'https://t.me/rso_help_dir/38',
    7: 'https://t.me/rso_help_dir/39',
    8: 'https://t.me/rso_help_dir/40',
    9: 'https://t.me/rso_help_dir/41',
    10: 'https://t.me/rso_help_dir/42',
    11: 'https://t.me/rso_help_dir/43',
}

# словарь кнопок для отходов, которые принимаются в категории "Пластик"
PLASTIC_ACCEPTED_LIST = {
    1: '1 или PET',
    2: '2 или PE-HD (HDPE)',
    3: '4 или PE-LD (LDPE)',
    4: '5 или PP',
    5: '6 или PS',
}

# словарь url для поиска изображений в пункте "Что принимается" в категории "Пластик"
PLASTIC_ACCEPTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/44',
    2: 'https://t.me/rso_help_dir/45',
    3: 'https://t.me/rso_help_dir/46',
    4: 'https://t.me/rso_help_dir/47',
    5: 'https://t.me/rso_help_dir/48'
}

# словарь кнопок для отходов, которые не принимаются в категории "Пластик"
PLASTIC_REJECTED_LIST = {
    1: '3 или PVC',
    2: '7 или OTHER',
    3: 'АБС-пластик',
}

# словарь url для поиска изображений в пункте "Что не принимается" в категории "Пластик"
PLASTIC_REJECTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/49',
    2: 'https://t.me/rso_help_dir/50',
    3: 'https://t.me/rso_help_dir/51',
}

# словарь кнопок для отходов, которые принимаются в категории "Металл"
METAL_ACCEPTED_LIST = {
    1: 'Алюминиевые или жестяные банки',
    2: 'Металлические крышки',
    3: 'Металл с другими материалами',
}

# словарь url для поиска изображений в пункте "Что принимается" в категории "Металл"
METAL_ACCEPTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/52',
    2: 'https://t.me/rso_help_dir/61',
    3: 'https://t.me/rso_help_dir/55',
}

# словарь кнопок для отходов, которые не принимаются в категории "Металл"
METAL_REJECTED_LIST = {
    1: 'Аэрозольные баллончики',
    2: 'Огнетушители',
    3: 'Алюминиевые тюбики',
    4: 'Фольга'
}

# словарь url для поиска изображений в пункте "Что не принимается" в категории "Металл"
METAL_REJECTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/56',
    2: 'https://t.me/rso_help_dir/62',
    3: 'https://t.me/rso_help_dir/59',
    4: 'https://t.me/rso_help_dir/60',
}

# словарь кнопок для отходов, которые принимаются в категории "Батарейки"
BATTERY_ACCEPTED_LIST = {
    1: '"Пальчиковые" батарейки',
    2: 'Батарейки-"таблетки"',
    3: 'Литий-ионные аккумуляторы',
    4: 'Аккумуляторы от UPS/ИБП'
}

# словарь url для поиска изображений в пункте "Что принимается" в категории "Батарейки"
BATTERY_ACCEPTED_PICTURES = {
    1: 'https://t.me/rso_help_dir/63',
    2: 'https://t.me/rso_help_dir/64',
    3: 'https://t.me/rso_help_dir/65',
    4: 'https://t.me/rso_help_dir/66'
}
